# To predict a person salary>100k based on company,job and degree

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('D:\AI-datasource\data13.csv')
data

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [3]:
#splitting the dataset into input and output
#input=(job,degree,and company)
#output=salary_more_then_100k

In [4]:
input=data.drop(['salary_more_then_100k'],axis=1)

In [5]:
input

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [6]:
target=data.salary_more_then_100k

In [7]:
target #salary_more_then_100k  0==>no, 1==>yes

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [8]:
#ML model work very well on numerical data so we have to convert the data of input into numbers

In [9]:
from sklearn.preprocessing import LabelEncoder
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [10]:
# to  create new columns in input that represents its own numerical form
input['com_n']=le_company.fit_transform(input['company'])
input['job_n']=le_job.fit_transform(input['job'])
input['degree_n']=le_degree.fit_transform(input['degree'])

In [11]:
input

       company                  job     degree  com_n  job_n  degree_n
0       google      sales executive  bachelors      2      2         0
1       google      sales executive    masters      2      2         1
2       google     business manager  bachelors      2      0         0
3       google     business manager    masters      2      0         1
4       google  computer programmer  bachelors      2      1         0
5       google  computer programmer    masters      2      1         1
6   abc pharma      sales executive    masters      0      2         1
7   abc pharma  computer programmer  bachelors      0      1         0
8   abc pharma     business manager  bachelors      0      0         0
9   abc pharma     business manager    masters      0      0         1
10    facebook      sales executive  bachelors      1      2         0
11    facebook      sales executive    masters      1      2         1
12    facebook     business manager  bachelors      1      0         0
13    facebook     business manager    masters      1      0         1
14    facebook  computer programmer  bachelors      1      1         0
15    facebook  computer programmer    masters      1      1         1

In [12]:
# drop the next data from inputs
input_n=input.drop(['company','job','degree'],axis=1)

In [13]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [14]:
input_n

    com_n  job_n  degree_n
0       2      2         0
1       2      2         1
2       2      0         0
3       2      0         1
4       2      1         0
5       2      1         1
6       0      2         1
7       0      1         0
8       0      0         0
9       0      0         1
10      1      2         0
11      1      2         1
12      1      0         0
13      1      0         1
14      1      1         0
15      1      1         1

In [15]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [16]:
model.fit(input_n,target)

DecisionTreeClassifier()

In [17]:
model.score(input_n,target)

1.0

Q: Is salary of google ,computer engineer,bachelors degree>100k?

In [18]:
model.predict([[2,1,0]]) #google=2,computer engineer=1,bacherlors degree=0,output=no

array([0], dtype=int64)

Q: Is salary of google ,computer engineer,masters degree>100k?

In [19]:
model.predict([[2,1,1]])

array([1], dtype=int64)

In [20]:
#exercise

In [200]:
dt=pd.read_csv('D:\AI-datasource\data14.titanic.csv')
dt

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [201]:
dt['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [202]:
dt.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [203]:
x=dt['Age'].mean()
x

29.69911764705882

In [204]:
dt.fillna(x,inplace=True)
dt

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,29.699118,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,29.699118,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,29.699118,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,29.699118,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,29.699118,Q

In [205]:
dt['Age'].isnull().sum()

0

In [206]:
input1=dt.drop(['Survived',],axis=1)

In [207]:
input1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,29.699118,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,29.699118,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,29.699118,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,29.699118,S
889,890,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,29.699118,Q

In [208]:
target=dt.Survived

In [209]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [210]:
from sklearn.preprocessing import LabelEncoder
le_Pclass=LabelEncoder()
le_Sex=LabelEncoder()
le_Fare=LabelEncoder()
le_Age=LabelEncoder()

In [211]:
input1['Pclass_n']=le_Pclass.fit_transform(input1['Pclass'])
input1['sex_n']=le_Sex.fit_transform(input1['Sex'])
input1['age_n']=le_Age.fit_transform(input1['Age'])
input1['Fare_n']=le_Fare.fit_transform(input1['Fare'])

In [212]:
input1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_n,sex_n,age_n,Fare_n
0,1,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,29.699118,S,2,1,28,18
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,0,0,52,207
2,3,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,2,0,34,41
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,0,0,48,189
4,5,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,29.699118,S,2,1,48,43
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,29.699118,S,1,1,35,85
887,888,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S,0,0,24,153
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,29.699118,S,2,0,39,131
889,890,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C,0,1,34,153
890,891,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,29.699118,Q,2,1,43,30

In [213]:
input_n2=input1.drop(['PassengerId','Pclass','Sex','Age','Fare','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)

In [216]:
input_n2

     Pclass_n  sex_n  age_n  Fare_n
0           2      1     28      18
1           0      0     52     207
2           2      0     34      41
3           0      0     48     189
4           2      1     48      43
..        ...    ...    ...     ...
886         1      1     35      85
887         0      0     24     153
888         2      0     39     131
889         0      1     34     153
890         2      1     43      30

[891 rows x 4 columns]

In [217]:
input_n2.tail(10)

     Pclass_n  sex_n  age_n  Fare_n
881         2      1     45      40
882         2      0     28      73
883         1      1     36      72
884         2      1     33      12
885         2      0     53     151
886         1      1     35      85
887         0      0     24     153
888         2      0     39     131
889         0      1     34     153
890         2      1     43      30

In [218]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [219]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [220]:
model.fit(input_n2,target)

DecisionTreeClassifier()

In [221]:
model.score(input_n2,target)

0.9797979797979798

In [222]:
model.predict([[2,1,28,18]])

array([0], dtype=int64)

In [223]:
model.predict([[0,0,34,153]])

array([1], dtype=int64)